import './Biography.css';

const Biography = () => 
{
    return (
        <section>
            <h3>Биография</h3>
            <p>Уилл Смит (полное имя Уиллард Кэрролл Смит-младший) родился 25 сентября 1968 года в Филадельфии, Пенсильвания, США. Он является известным американским актером, продюсером и музыкантом. Уилл Смит приобрел мировую известность благодаря своим ролям в фильмах, таких как "День независимости", "Люди в черном", "Я — легенда", "Али" и многих других. Его карьера началась в качестве рэпера под псевдонимом "The Fresh Prince".</p>
        </section>
    );
};

export default Biography;
